"""
Небольшой модуль для информирования пользователя о последних новостях, изменениях и обновлениях сервиса.
По запросу (например, после нажатия на кнопку “Новости”) бот присылает преднастроенное сообщение с важными новостями.
Позволяет всегда держать пользователей в курсе актуальной информации, а также привлекать внимание к новым функциям.
"""
class PushNotify:
    def __init__(self, bot, is_enabled_cb):
        self.bot = bot
        self.is_enabled = is_enabled_cb

    def handle(self, msg):
        if not self.is_enabled('push_notify'):
            return False

        if msg.text == "📢 Новости":
            self.bot.send_message(
                msg.chat.id, "📢 Последние новости:\n- Добавлен FAQ.\n- Появился QR-сканер.\n- Бот работает лучше!")
            return True

        return False
